
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |    Destroy |
|----------:|---------:|------------:|-----------:|
|        ✅ |        1 |          10 |          0 |
## Affected resources by action

|  Action  | Resources                                                                   |
|:--------:|:----------------------------------------------------------------------------|
|    🟢    | `module.vpn.module.openvpn-portal.module.pod.aws_alb_listener_rule.website` |
|    🟡    | `module.vpn.aws_autoscaling_group.openvpn`                                  |
|    🟡    | `module.vpn.module.instance_profile.aws_iam_policy.profile`                 |
|    🟡    | `module.vpn.module.openvpn-portal.aws_ecs_capacity_provider.ecs`            |
|    🟡    | `module.vpn.module.openvpn-portal.aws_ecs_cluster.ecs`                      |
|    🟡    | `module.vpn.module.openvpn-portal.aws_ecs_service.ecs`                      |
|    🟡    | `module.vpn.module.openvpn-portal.aws_ecs_task_definition.ecs`              |
|    🟡    | `module.vpn.module.openvpn-portal.aws_iam_role.ecs_task_execution_role`     |
|    🟡    | `module.vpn.module.openvpn-portal.module.pod.aws_autoscaling_group.website` |
|    🟡    | `module.vpn.module.openvpn-portal.module.pod.aws_launch_template.website`   |
|    🟡    | `module.vpn.module.openvpn-portal.module.pod.aws_lb_listener.ssl`           |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.vpn.data.aws_iam_policy_document.instance_permissions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "instance_permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sts:GetCallerIdentity",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:DescribeInstances",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:ModifyInstanceAttribute",
            ]
          + resources = [
              + "*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "openvpn-2024070518392010580000001e-nRBgZQ",
                ]
              + variable = "ec2:ResourceTag/aws:autoscaling:groupName"
            }
        }
    }

  # module.vpn.aws_autoscaling_group.openvpn will be updated in-place
  ~ resource "aws_autoscaling_group" "openvpn" {
      ~ health_check_type                = "EC2" -> "ELB"
        id                               = "openvpn-2024070518392010580000001e-nRBgZQ"
        name                             = "openvpn-2024070518392010580000001e-nRBgZQ"
        # (30 unchanged attributes hidden)

      + mixed_instances_policy {
          + instances_distribution {
              + on_demand_base_capacity                  = 0
              + on_demand_percentage_above_base_capacity = 0
            }
          + launch_template {
              + launch_template_specification {
                  + launch_template_id = "lt-0f7a032c61f3f5094"
                  + version            = "8"
                }
              + override (known after apply)
            }
        }

        # (9 unchanged blocks hidden)
    }

  # module.vpn.module.instance_profile.aws_iam_policy.profile will be updated in-place
  ~ resource "aws_iam_policy" "profile" {
        id               = "arn:aws:iam::493370826424:policy/openvpn-8u1hU4OyuQDT20240705183937201200000024"
        name             = "openvpn-8u1hU4OyuQDT20240705183937201200000024"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "sts:GetCallerIdentity"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "ec2:DescribeInstances"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action    = "ec2:ModifyInstanceAttribute"
                      - Condition = {
                          - StringEquals = {
                              - "ec2:ResourceTag/aws:autoscaling:groupName" = "openvpn-2024070518392010580000001e-nRBgZQ"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "created_by_module" = "infrahouse/instance-profile/aws"
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpn.module.openvpn-portal.aws_ecs_capacity_provider.ecs will be updated in-place
  ~ resource "aws_ecs_capacity_provider" "ecs" {
        id       = "arn:aws:ecs:us-west-1:493370826424:capacity-provider/openvpn-portal"
        name     = "openvpn-portal"
      ~ tags     = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/ecs/aws"
            "environment"       = "development"
          ~ "module_version"    = "3.7.0" -> "3.14.0"
            "service"           = "openvpn-portal"
        }
      ~ tags_all = {
          ~ "module_version"    = "3.7.0" -> "3.14.0"
            # (5 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.vpn.module.openvpn-portal.aws_ecs_cluster.ecs will be updated in-place
  ~ resource "aws_ecs_cluster" "ecs" {
        id       = "arn:aws:ecs:us-west-1:493370826424:cluster/openvpn-portal"
        name     = "openvpn-portal"
      ~ tags     = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/ecs/aws"
            "environment"       = "development"
          ~ "module_version"    = "3.7.0" -> "3.14.0"
            "service"           = "openvpn-portal"
        }
      ~ tags_all = {
          ~ "module_version"    = "3.7.0" -> "3.14.0"
            # (5 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

      - setting {
          - name  = "containerInsights" -> null
          - value = "enabled" -> null
        }
      + setting {
          + name  = "containerInsights"
          + value = "disabled"
        }
    }

  # module.vpn.module.openvpn-portal.aws_ecs_service.ecs will be updated in-place
  ~ resource "aws_ecs_service" "ecs" {
        id                                 = "arn:aws:ecs:us-west-1:493370826424:service/openvpn-portal/openvpn-portal"
        name                               = "openvpn-portal"
      ~ tags                               = {
            "account"                         = "493370826424"
            "backend_security_group"          = "eyJiYWNrZW5kIjp7ImlkIjoic2ctMGI2MjQ0YjkwOGIzMGE2NmQiLCJydWxlcyI6eyJiYWNrZW5kX2ljbXAiOiJzZ3ItMDg4NGZjYmYxNmViNzA4YTgiLCJiYWNrZW5kX291dGdvaW5nIjoic2dyLTAyOWE2MGFiM2ZmZWI5YjNlIiwiYmFja2VuZF9zc2hfaW5wdXQiOm51bGwsImJhY2tlbmRfc3NoX2xvY2FsIjoic2dyLTBiZjBiYzM5MGY3"
            "created_by_module"               = "infrahouse/ecs/aws"
            "environment"                     = "development"
            "execution_role_arn"              = "arn:aws:iam::493370826424:role/openvpn-portalTaskExecutionRole20240705183912611900000005"
            "instance_role_policy_attachment" = "openvpn-portal-instance-j8szhwpnnnfu20240705183912601000000001-20240705183914452000000010"
            "instance_role_policy_name"       = "openvpn-portal-instance-j8szhwpnnnfu2024070518391381960000000c"
            "load_balancer_arn"               = "arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/openvp2024070518391751950000001c/539fb530eebce408"
          ~ "module_version"                  = "3.7.0" -> "3.14.0"
            "service"                         = "openvpn-portal"
            "target_group_arn"                = "arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-2024070518391297700000000a/a48a76cdd3cd12a8"
        }
      ~ tags_all                           = {
          ~ "module_version"                  = "3.7.0" -> "3.14.0"
            # (11 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.vpn.module.openvpn-portal.aws_ecs_task_definition.ecs will be updated in-place
  ~ resource "aws_ecs_task_definition" "ecs" {
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ container_definitions    = (sensitive value)
        id                       = "openvpn-portal"
      ~ tags                     = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/ecs/aws"
            "environment"       = "development"
          ~ "module_version"    = "3.7.0" -> "3.14.0"
            "service"           = "openvpn-portal"
        }
      ~ tags_all                 = {
          ~ "module_version"    = "3.7.0" -> "3.14.0"
            # (5 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpn.module.openvpn-portal.aws_iam_role.ecs_task_execution_role will be updated in-place
  ~ resource "aws_iam_role" "ecs_task_execution_role" {
        id                    = "openvpn-portalTaskExecutionRole20240705183912611900000005"
        name                  = "openvpn-portalTaskExecutionRole20240705183912611900000005"
      ~ tags                  = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/ecs/aws"
            "environment"       = "development"
          ~ "module_version"    = "3.7.0" -> "3.14.0"
            "service"           = "openvpn-portal"
        }
      ~ tags_all              = {
          ~ "module_version"    = "3.7.0" -> "3.14.0"
            # (5 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_alb_listener_rule.website will be created
  + resource "aws_alb_listener_rule" "website" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/openvp2024070518391751950000001c/539fb530eebce408/f6f06f03b6060c16"
      + priority     = 99
      + tags         = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "openvpn-portal"
        }
      + tags_all     = {
          + "account"           = "493370826424"
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "openvpn-portal"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-2024070518391297700000000a/a48a76cdd3cd12a8"
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "openvpn-portal.infrahouse.com",
                ]
            }
        }
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_autoscaling_group.website will be updated in-place
  ~ resource "aws_autoscaling_group" "website" {
        id                               = "openvp2024070518391750040000001b"
        name                             = "openvp2024070518391750040000001b"
        # (32 unchanged attributes hidden)

      + mixed_instances_policy {
          + instances_distribution {
              + on_demand_base_capacity                  = 0
              + on_demand_percentage_above_base_capacity = 0
            }
          + launch_template {
              + launch_template_specification {
                  + launch_template_id = "lt-0ef83181fbf251354"
                  + version            = (known after apply)
                }
              + override (known after apply)
            }
        }

      - tag {
          - key                 = "parent_module_version" -> null
          - propagate_at_launch = true -> null
          - value               = "3.7.0" -> null
        }
      + tag {
          + key                 = "parent_module_version"
          + propagate_at_launch = true
          + value               = "3.14.0"
        }

        # (11 unchanged blocks hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_launch_template.website will be updated in-place
  ~ resource "aws_launch_template" "website" {
        id                                   = "lt-0ef83181fbf251354"
      ~ latest_version                       = 12 -> (known after apply)
        name                                 = "openvp20240705183917137600000019"
        tags                                 = {}
        # (17 unchanged attributes hidden)

      + metadata_options {
          + http_tokens = "required"
        }

        # (4 unchanged blocks hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_lb_listener.ssl will be updated in-place
  ~ resource "aws_lb_listener" "ssl" {
        id                = "arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/openvp2024070518391751950000001c/539fb530eebce408/f6f06f03b6060c16"
        tags              = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/website-pod/aws"
            "environment"       = "development"
            "service"           = "openvpn-portal"
        }
        # (7 unchanged attributes hidden)

      ~ default_action {
          ~ type             = "forward" -> "fixed-response"
            # (2 unchanged attributes hidden)

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "The server cannot or will not process the request due to an apparent client error (e.g., malformed request syntax, size too large, invalid request message framing, or deceptive request routing)."
              + status_code  = "400"
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 10 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDEsICJjaGFuZ2UiOiAxMCwgImRlc3Ryb3kiOiAwfX0=
```
</details>